app/controllers/events_controller.rb

INSERT INTO "events" ("name", "description", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["description", ""], ["date", nil], ["created_at", "2023-10-09 20:52:00.111312"], ["updated_at", "2023-10-09 20:52:00.111312"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]
---
  def destroy
    @event.destroy